In [13]:
import pandas as pd

In [14]:
df=pd.DataFrame({'From_To':['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],\
                            'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],\
                            'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],\
                            'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [15]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
From_To         5 non-null object
FlightNumber    3 non-null float64
RecentDelays    5 non-null object
Airline         5 non-null object
dtypes: float64(1), object(3)
memory usage: 288.0+ bytes

In [17]:
'''1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row 
so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column 
(instead of a float column).'''

df.FlightNumber.interpolate(method='linear',inplace=True,)
df.FlightNumber=df.FlightNumber.astype(int)

In [18]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [19]:
'''2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give 
a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.'''

df[["From","To"]]=df.From_To.str.split("_",expand=True)
df.columns

Index(['From_To', 'FlightNumber', 'RecentDelays', 'Airline', 'From', 'To'], dtype='object')

In [20]:
''' 4. Delete the From_To column from df '''

df.drop("From_To",axis=1)

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    LoNDon      paris
1         10055            []    <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

In [21]:
df=df.reindex(columns=('From', 'To','FlightNumber', 'RecentDelays', 'Airline'))
df

       From         To  FlightNumber  RecentDelays              Airline
0    LoNDon      paris         10045      [23, 47]               KLM(!)
1    MAdrid      miLAN         10055            []    <Air France> (12)
2    londON  StockhOlm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      PaRis         10075          [13]       12. Air France
4  Brussels     londOn         10085      [67, 32]          "Swiss Air"

In [22]:
''' 3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings 
so that only the first letter is uppercase (e.g. "londON" should become "London".)'''

df.From=df.From.str.capitalize()
df.To=df.To.str.capitalize()

In [23]:
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

In [24]:
'''5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value 
in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted 
RecentDelays column in df with delays.''' 

df[["delay_1","delay_2","delay_3"]]=pd.DataFrame(df.RecentDelays.to_list())
df.drop("RecentDelays",axis=1)

,From,To,FlightNumber,Airline,delay_1,delay_2,delay_3
0,London,Paris,10045,KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055,<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065,(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,10075,12. Air France,13.0,NaN,NaN
4,Brussels,London,10085,"""Swiss Air""",67.0,32.0,NaN